===
Empty tag
===

#()

---

(source_file
  (tag
    (parameter_list)))

===
Variable (no-name tag)
===

#(title)

---

(source_file
  (tag
    (parameter_list
      (operator_parameter
        (identifier)))))

===
Simple tag with context variable parameter
===

#count(users)

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)))))

===
Simple tag with string variable parameter
===

#embed("base")

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (string_parameter
        (string)))))

===
Tag with variable body
===

#if(title) {
  #(title)
}

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)))
    (body
      (definitions
        (tag
          (parameter_list
            (operator_parameter
              (identifier))))))))

===
Tag with text body
===

#set(title) { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)))
    (body
      (definitions
        (raw_text)))))

===
For loop
===

#for(foo in bar) { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)
        (operator_parameter
          (identifier))))
    (body
      (definitions
        (raw_text)))))

===
Multi-operator expressions
===

#if(1 <= 2) { Hello world! }
#if(1 + 2 == 3) { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)
        (operator_parameter
          (identifier))))
    (body
      (definitions
        (raw_text))))
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)
        (operator_parameter
          (identifier)
          (operator_parameter
            (identifier)))))
    (body
      (definitions
        (raw_text)))))

===
Dot notation
===

#if(foo.bar) { Wubba lubba dub-dub! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (operator_parameter
        (identifier)
        (operator_parameter
          (identifier))))
    (body
      (definitions
        (raw_text)))))
