===
Empty tag
===

#()

---

(source_file
  (tag
    (parameter_list)))

===
Variable (no-name tag)
===

#(title)

---

(source_file
  (tag
    (parameter_list
      (identifier))))

===
Simple tag with context variable parameter
===

#count(users)

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier))))

===
Simple tag with string variable parameter
===

#embed("base")

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (string_parameter
        (string)))))

===
Tag with variable body
===

#if(title) {
  #(title)
}

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier))
    (body
      (definitions
        (tag
          (parameter_list
            (identifier)))))))

===
Tag with text body
===

#set(title) { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text)))))

===
For loop
===

#for(foo in bar) { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier)
      (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text)))))

===
Multi-operator expressions
===

#if(1 <= 2) { Hello world! }
#if(1 + 2 == 3) { Hello world! }
#if(someString == "YOLO!") { Hello world! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier)
      (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text))))
  (tag
    (name
      (identifier))
    (parameter_list
        (identifier)
        (identifier)
        (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text))))
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier)
      (string_parameter
        (string)))
    (body
      (definitions
        (raw_text)
        (raw_text)))))

===
Dot notation
===

#if(foo.bar) { Wubba lubba dub-dub! }

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier)
      (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text)
        (raw_text)))))

===
If with else
===

#if(foo.bar) {
  Wubba lubba dub-dub!
} else if (false) {
  Not true!
} else {
  Squanch!
}

---

(source_file
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier)
      (identifier))
    (body
      (definitions
        (raw_text)
        (raw_text)
        (raw_text))
      (else_if
        (parameter_list
          (identifier))
        (body
          (definitions
            (raw_text)
            (raw_text))
          (else
            (body
              (definitions
                (raw_text)))))))))

===
If with comments
===

#/* Some rather stupid
multiline comments */
#if(true) {
  #// Nothing to do here
}

---

(source_file
  (comment)
  (tag
    (name
      (identifier))
    (parameter_list
      (identifier))
    (body
      (definitions
        (comment
          (raw_text))
          (raw_text)
          (raw_text)
          (raw_text)))))
