===
Variable (no-name tag)
===

#(title)

---

(source_file
  (tag_definition
    (parameter_list
      (identifier))))

===
Simple tag with context variable parameter
===

#count(users)

---

(source_file
  (tag_definition
    (name
      (identifier))
    (parameter_list
      (identifier))))

===
Simple tag with string variable parameter
===

#embed("base")

---

(source_file
  (tag_definition
    (name
      (identifier))
    (parameter_list
      (string_parameter
        (string)))))

===
Tag with variable body
===

#if(title) {
  #(title)
}

---

(source_file
  (tag_definition
    (name
      (identifier))
    (parameter_list
      (identifier))
    (body
      (definitions
        (tag_definition
          (parameter_list
            (identifier)))))))

===
Tag with text body
===

#set(title) { Hello world! }

---

(source_file
  (tag_definition
    (name
      (identifier))
    (parameter_list
      (identifier))
    (body
      (definitions
        (junk_definition)))))
